using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace LangLayoutSwitcher.Classes
{
    public class DictionaryClass
    {

        public static Dictionary<string, string> DictEngToRus = new Dictionary<string, string>
        {
            ["`"] = "ё",
            ["~"] = "Ё",
            ["@"] = "\"",
            ["#"] = "№",
            ["$"] = ";",
            ["^"] = ":",
            ["&"] = "?",

            ["q"] = "й",
            ["w"] = "ц",
            ["e"] = "у",
            ["r"] = "к",
            ["t"] = "е",
            ["y"] = "н",
            ["u"] = "г",
            ["i"] = "ш",
            ["o"] = "щ",
            ["p"] = "з",
            ["["] = "х",
            ["{"] = "Х",
            ["]"] = "ъ",
            ["}"] = "Ъ",

            ["a"] = "ф",
            ["s"] = "ы",
            ["d"] = "в",
            ["f"] = "а",
            ["g"] = "п",
            ["h"] = "р",
            ["j"] = "о",
            ["k"] = "л",
            ["l"] = "д",
            [";"] = "ж",
            [":"] = "Ж",
            ["\'"] = "э",
            ["\""] = "Э",
            
            ["z"] = "я",
            ["x"] = "ч",
            ["c"] = "с",
            ["v"] = "м",
            ["b"] = "и",
            ["n"] = "т",
            ["m"] = "ь",
            [","] = "б",
            ["<"] = "Б",
            ["."] = "ю",
            [">"] = "Ю",
            ["?"] = ",",
            ["/"] = ".",
        };

        public static Dictionary<string, string> DictRusToEng = new Dictionary<string, string>
        {
            ["ё"] = "`",
            ["Ё"] = "~",
            ["\""] = "@",
            ["№"] = "#",
            [";"] = "$",
            [":"] = "^",
            ["?"] = "&",

            ["й"] = "q",
            ["ц"] = "w",
            ["у"] = "e",
            ["к"] = "r",
            ["е"] = "t",
            ["н"] = "y",
            ["г"] = "u",
            ["ш"] = "i",
            ["щ"] = "o",
            ["з"] = "p",
            ["х"] = "[",
            ["Х"] = "{",
            ["ъ"] = "]",
            ["Ъ"] = "}",

            ["ф"] = "a",
            ["ы"] = "s",
            ["в"] = "d",
            ["а"] = "f",
            ["п"] = "g",
            ["р"] = "h",
            ["о"] = "j",
            ["л"] = "k",
            ["д"] = "l",
            ["ж"] = ";",
            ["Ж"] = ":",
            ["э"] = "\'",
            ["Э"] = "\"",

            ["я"] = "z",
            ["ч"] = "x",
            ["с"] = "c",
            ["м"] = "v",
            ["и"] = "b",
            ["т"] = "n",
            ["ь"] = "m",
            ["б"] = ",",
            ["Б"] = "<",
            ["ю"] = ".",
            ["Ю"] = ">",
            [","] = "?",
            ["."] = "/",
        };

    }
}
